#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_region.current: Reading...
aws_cloudwatch_log_group.log_state_machine_produto_credito: Refreshing state... [id=log_state_machine_produto_credito]
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Read complete after 0s [id=850202893763]
aws_sfn_state_machine.produto_credito_state_machine: Refreshing state... [id=arn:aws:states:us-east-1:850202893763:stateMachine:produto_credito_state_machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.produto_credito_eventbridge will be created
  + resource "aws_cloudwatch_event_rule" "produto_credito_eventbridge" {
      + arn                 = (known after apply)
      + description         = "Agendamento para execução mensal do produto de crédito"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "produto_credito_eventbridge"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 14 5 * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.target_produto_credito will be created
  + resource "aws_cloudwatch_event_target" "target_produto_credito" {
      + arn            = "arn:aws:states:us-east-1:850202893763:stateMachine:produto_credito_state_machine"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::850202893763:role/RoleProducerDMA"
      + rule           = "produto_credito_eventbridge"
      + target_id      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rodolfoarmelim, Action: `pull_request`*